In [1]:
import pandas as pd
import numpy as np

In [2]:
file = pd.read_csv("../data/working.csv")

In [3]:
file.head()

,year,Korea,Costa Rica,Mexico,Chile,Greece,Iceland,Israel,Poland,Russian Federation,...,United Kingdom,Switzerland,Sweden,Luxembourg,Belgium,France,Denmark,Netherlands,Norway,Germany
0,2000,2512,2368,2311,2263,2108,2040,1998,1988,1982,...,1700,1674,1642,1602,1595,1535,1466,1462,1455,1452
1,2001,2499,2335,2285,2242,2101,2053,1979,1974,1980,...,1705,1635,1618,1586,1588,1526,1469,1452,1429,1442
2,2002,2464,2363,2271,2250,2093,2012,1993,1979,1982,...,1684,1614,1595,1581,1583,1487,1463,1435,1414,1431
3,2003,2424,2356,2277,2235,2091,1972,1974,1984,1993,...,1674,1627,1582,1579,1578,1484,1458,1427,1401,1425
4,2004,2392,2375,2271,2232,2083,1980,1942,1983,1993,...,1674,1657,1605,1578,1573,1513,1458,1448,1421,1422

In [4]:
work = pd.DataFrame({"country":[], "year":[],"work_hours":[]})

In [32]:
work

Empty DataFrame
Columns: [country, year, work_hours]
Index: []

In [23]:
country_list = file.columns.to_list()

In [26]:
country_list = country_list[1:]

In [39]:
country_list

['Korea',
 'Costa Rica',
 'Mexico',
 'Chile',
 'Greece',
 'Iceland',
 'Israel',
 'Poland',
 'Russian Federation',
 'Estonia',
 'Latvia',
 'Turkey',
 'Ireland',
 'Portugal',
 'Czech Republic',
 'Italy',
 'Lithuania',
 'Hungary',
 'New Zealand',
 'United States',
 'OECD countries',
 'Japan',
 'Slovak Republic',
 'Austria',
 'Australia',
 'Canada',
 'Spain',
 'Finland',
 'Slovenia',
 'United Kingdom',
 'Switzerland',
 'Sweden',
 'Luxembourg',
 'Belgium',
 'France',
 'Denmark',
 'Netherlands',
 'Norway',
 'Germany']

In [ ]:
file.loc[]

In [18]:
file.iloc[0,1]

2512

In [44]:
country_df = []
year_df = []
work_hours_df = []
for i in range(len(country_list)): 
    for j in range(len(file)):
        country_df.append(country_list[i])
        year_df.append(file.iloc[j,0])
        work_hours_df.append(file.iloc[j,i+1])

In [46]:
work = pd.DataFrame({"country":country_df, "year":year_df,"work_hours":work_hours_df})

In [47]:
work

     country  year  work_hours
0      Korea  2000        2512
1      Korea  2001        2499
2      Korea  2002        2464
3      Korea  2003        2424
4      Korea  2004        2392
..       ...   ...         ...
619  Germany  2011        1393
620  Germany  2012        1375
621  Germany  2013        1362
622  Germany  2014        1368
623  Germany  2015        1368

[624 rows x 3 columns]

In [48]:
work.to_csv("../data/work_df.csv",index=False)